TRUE
CLIPS> (batch "attchtst4.bat")
TRUE
CLIPS> (clear) ; Case 1a
CLIPS> (load* "attchtst4.clp")
TRUE
CLIPS> 
(defrule fail-pass "Case 1a"
   (a)
   (test (= 1 1))
   =>)
CLIPS> 
(defrule fail-fail "Case 1a"
   (b)
   (test (!= 2 2))
   =>)
CLIPS> (agenda)
CLIPS> (assert (a) (b))
<Fact-2>
CLIPS> (agenda)
0      fail-pass: f-1
For a total of 1 activation.
CLIPS> (clear) ; Case 1b
CLIPS> (load* "attchtst4.clp")
TRUE
CLIPS> 
(defrule pass-fail "Case 1b"
   (not (a))
   (test (= 1 1))
   =>)
CLIPS> 
(defrule fail-fail "Case 1b"
   (not (b))
   (test (!= 2 2))
   =>)
CLIPS> (agenda)
0      pass-fail: *
For a total of 1 activation.
CLIPS> (assert (a) (b))
<Fact-2>
CLIPS> (agenda)
CLIPS> (clear) ; Case 1c
CLIPS> (load* "attchtst4.clp")
TRUE
CLIPS> 
(defrule fail-pass "Case 1c"
   (exists (a))
   (test (= 1 1))
   =>)
CLIPS> 
(defrule fail-fail "Case 1c"
   (exists (b))
   (test (!= 2 2))
   =>)
CLIPS> (agenda)
CLIPS> (assert (a) (b))
<Fact-2>
CLIPS> (agenda)
0      fail-pass: *
For a total of 1 activation.
CLIPS> (clear) ; Case 3a
CLIPS> (load* "attchtst4.clp")
TRUE
CLIPS> 
(defrule pass-fail "Case 3a"
   (not (and (a)
             (test (= 1 1))))
   =>)
CLIPS> 
(defrule pass-pass "Case 3a"
   (not (and (b)
             (test (!= 2 2))))
   =>)
CLIPS> (agenda)
0      pass-pass: *
0      pass-fail: *
For a total of 2 activations.
CLIPS> (assert (a) (b))
<Fact-2>
CLIPS> (agenda)
0      pass-pass: *
For a total of 1 activation.
CLIPS> (clear) ; Case 3b
CLIPS> (load* "attchtst4.clp")
TRUE
CLIPS> 
(defrule fail-pass "Case 3b"
   (not (and (not (a))
             (test (= 1 1))))
   =>)
CLIPS> 
(defrule pass-pass "Case 3b"
   (not (and (not (b))
             (test (!= 2 2))))
   =>)
CLIPS> (agenda)
0      pass-pass: *
For a total of 1 activation.
CLIPS> (assert (a) (b))
<Fact-2>
CLIPS> (agenda)
0      fail-pass: *
0      pass-pass: *
For a total of 2 activations.
CLIPS> (clear) ; Case 3c
CLIPS> (load* "attchtst4.clp")
TRUE
CLIPS> 
(defrule pass-fail "Case 3c"
   (not (and (exists (a))
             (test (= 1 1))))
   =>)
CLIPS> 
(defrule pass-pass "Case 3c"
   (not (and (exists (b))
             (test (!= 2 2))))
   =>)
CLIPS> (agenda)
0      pass-pass: *
0      pass-fail: *
For a total of 2 activations.
CLIPS> (assert (a) (b))
<Fact-2>
CLIPS> (agenda)
0      pass-pass: *
For a total of 1 activation.
CLIPS> (clear) ; Case 3d
CLIPS> (load* "attchtst4.clp")
TRUE
CLIPS> 
(defrule fail-pass "Case 3d"
   (exists (and (a)
                (test (= 1 1))))
   =>)
CLIPS> 
(defrule fail-fail "Case 3d"
   (exists (and (b)
                (test (!= 2 2))))
   =>)
CLIPS> (agenda)
CLIPS> (assert (a) (b))
<Fact-2>
CLIPS> (agenda)
0      fail-pass: *
For a total of 1 activation.
CLIPS> (clear) ; Case 3e
CLIPS> (load* "attchtst4.clp")
TRUE
CLIPS> 
(defrule pass-fail "Case 3e"
   (exists (and (not (a))
                (test (= 1 1))))
   =>)
CLIPS> 
(defrule fail-fail "Case 3e"
   (exists (and (not (b))
                (test (!= 2 2))))
   =>)
CLIPS> (agenda)
0      pass-fail: *
For a total of 1 activation.
CLIPS> (assert (a) (b))
<Fact-2>
CLIPS> (agenda)
CLIPS> (clear) ; Case 3f
CLIPS> (load* "attchtst4.clp")
TRUE
CLIPS> 
(defrule fail-pass "Case 3f"
   (exists (and (exists (a))
                (test (= 1 1))))
   =>)
CLIPS> 
(defrule fail-fail "Case 3f"
   (exists (and (exists (b))
                (test (!= 2 2))))
   =>)
CLIPS> (agenda)
CLIPS> (assert (a) (b))
<Fact-2>
CLIPS> (agenda)
0      fail-pass: *
For a total of 1 activation.
CLIPS> (clear) ; Case 4a
CLIPS> (load* "attchtst4.clp")
TRUE
CLIPS> 
(defrule pass-pass-fail "Case 4a"
   (not (and (a)
             (b)
             (test (= 1 1))))
   =>)
CLIPS> 
(defrule pass-pass-pass "Case 4a"
   (not (and (c)
             (d)
             (test (!= 2 2))))
   =>)
CLIPS> (agenda)
0      pass-pass-pass: *
0      pass-pass-fail: *
For a total of 2 activations.
CLIPS> (assert (a) (c))
<Fact-2>
CLIPS> (agenda)
0      pass-pass-pass: *
0      pass-pass-fail: *
For a total of 2 activations.
CLIPS> (assert (b) (d))
<Fact-4>
CLIPS> (agenda)
0      pass-pass-pass: *
For a total of 1 activation.
CLIPS> (clear) ; Case 4b
CLIPS> (load* "attchtst4.clp")
TRUE
CLIPS> 
(defrule pass-fail-pass "Case 4b"
   (not (and (a)
             (not (b))
             (test (= 1 1))))
   =>)
CLIPS> 
(defrule pass-pass-pass "Case 4b"
   (not (and (c)
             (not (d))
             (test (!= 2 2))))
   =>)
CLIPS> (agenda)
0      pass-pass-pass: *
0      pass-fail-pass: *
For a total of 2 activations.
CLIPS> (assert (a) (c))
<Fact-2>
CLIPS> (agenda)
0      pass-pass-pass: *
For a total of 1 activation.
CLIPS> (assert (b) (d))
<Fact-4>
CLIPS> (agenda)
0      pass-fail-pass: *
0      pass-pass-pass: *
For a total of 2 activations.
CLIPS> (clear) ; Case 4c
CLIPS> (load* "attchtst4.clp")
TRUE
CLIPS> 
(defrule pass-pass-fail "Case 4c"
   (not (and (a)
             (exists (b))
             (test (= 1 1))))
   =>)
CLIPS> 
(defrule pass-pass-pass "Case 4c"
   (not (and (c)
             (exists (d))
             (test (!= 2 2))))
   =>)
CLIPS> (agenda)
0      pass-pass-pass: *
0      pass-pass-fail: *
For a total of 2 activations.
CLIPS> (assert (a) (c))
<Fact-2>
CLIPS> (agenda)
0      pass-pass-pass: *
0      pass-pass-fail: *
For a total of 2 activations.
CLIPS> (assert (b) (d))
<Fact-4>
CLIPS> (agenda)
0      pass-pass-pass: *
For a total of 1 activation.
CLIPS> (clear) ; Case 4d
CLIPS> (load* "attchtst4.clp")
TRUE
CLIPS> 
(defrule fail-fail-pass "Case 4d"
   (exists (and (a)
                (b)
                (test (= 1 1))))
   =>)
CLIPS> 
(defrule fail-fail-fail "Case 4d"
   (exists (and (c)
                (d)
                (test (!= 2 2))))
   =>)
CLIPS> (agenda)
CLIPS> (assert (a) (c))
<Fact-2>
CLIPS> (agenda)
CLIPS> (assert (b) (d))
<Fact-4>
CLIPS> (agenda)
0      fail-fail-pass: *
For a total of 1 activation.
CLIPS> (clear) ; Case 4e
CLIPS> (load* "attchtst4.clp")
TRUE
CLIPS> 
(defrule fail-pass-fail "Case 4e"
   (exists (and (a)
                (not (b))
                (test (= 1 1))))
   =>)
CLIPS> 
(defrule fail-fail-fail "Case 4e"
   (exists (and (c)
                (not (d))
                (test (!= 2 2))))
   =>)
CLIPS> (agenda)
CLIPS> (assert (a) (c))
<Fact-2>
CLIPS> (agenda)
0      fail-pass-fail: *
For a total of 1 activation.
CLIPS> (assert (b) (d))
<Fact-4>
CLIPS> (agenda)
CLIPS> (clear) ; Case 4f
CLIPS> (load* "attchtst4.clp")
TRUE
CLIPS> 
(defrule fail-fail-pass "Case 4f"
   (exists (and (a)
                (exists (b))
                (test (= 1 1))))
   =>)
CLIPS> 
(defrule fail-fail-fail "Case 4f"
   (exists (and (c)
                (exists (d))
                (test (!= 2 2))))
   =>)
CLIPS> (agenda)
CLIPS> (assert (a) (c))
<Fact-2>
CLIPS> (agenda)
CLIPS> (assert (b) (d))
<Fact-4>
CLIPS> (agenda)
0      fail-fail-pass: *
For a total of 1 activation.
CLIPS> (clear) ; Case 4g
CLIPS> (load* "attchtst4.clp")
TRUE
CLIPS> 
(defrule pass-fail-fail-pass "Case 4g"
   (not (and (not (and (x)
                       (y)))
             (a)
             (test (= 1 1))))
   =>)
CLIPS> 
(defrule pass-pass-pass-pass "Case 4g"
   (not (and (not (and (z)
                       (w)))
             (b)
             (test (!= 2 2))))
   =>)
CLIPS> (agenda)
0      pass-pass-pass-pass: *
0      pass-fail-fail-pass: *
For a total of 2 activations.
CLIPS> (assert (a) (b))
<Fact-2>
CLIPS> (agenda)
0      pass-pass-pass-pass: *
For a total of 1 activation.
CLIPS> (assert (x) (z))
<Fact-4>
CLIPS> (agenda)
0      pass-pass-pass-pass: *
For a total of 1 activation.
CLIPS> (assert (y) (w))
<Fact-6>
CLIPS> (agenda)
0      pass-fail-fail-pass: *
0      pass-pass-pass-pass: *
For a total of 2 activations.
CLIPS> (clear) ; Case 4h
CLIPS> (load* "attchtst4.clp")
TRUE
CLIPS> 
(defrule fail-pass-pass-pass "Case 4h"
   (not (and (not (and (x)
                       (y)))
             (not (a))
             (test (= 1 1))))
   =>)
CLIPS> 
(defrule pass-pass-pass-pass "Case 4h"
   (not (and (not (and (z)
                       (w)))
             (not (b))
             (test (!= 2 2))))
   =>)
CLIPS> (agenda)
0      pass-pass-pass-pass: *
For a total of 1 activation.
CLIPS> (assert (a) (b))
<Fact-2>
CLIPS> (agenda)
0      fail-pass-pass-pass: *
0      pass-pass-pass-pass: *
For a total of 2 activations.
CLIPS> (assert (x) (z))
<Fact-4>
CLIPS> (agenda)
0      fail-pass-pass-pass: *
0      pass-pass-pass-pass: *
For a total of 2 activations.
CLIPS> (assert (y) (w))
<Fact-6>
CLIPS> (agenda)
0      fail-pass-pass-pass: *
0      pass-pass-pass-pass: *
For a total of 2 activations.
CLIPS> (clear) ; Case 4i
CLIPS> (load* "attchtst4.clp")
TRUE
CLIPS> 
(defrule pass-fail-fail-pass "Case 4i"
   (not (and (not (and (x)
                       (y)))
             (exists (a))
             (test (= 1 1))))
   =>)
CLIPS> 
(defrule pass-pass-pass-pass "Case 4i"
   (not (and (not (and (z)
                       (w)))
             (exists (b))
             (test (!= 2 2))))
   =>)
CLIPS> (agenda)
0      pass-pass-pass-pass: *
0      pass-fail-fail-pass: *
For a total of 2 activations.
CLIPS> (assert (a) (b))
<Fact-2>
CLIPS> (agenda)
0      pass-pass-pass-pass: *
For a total of 1 activation.
CLIPS> (assert (x) (z))
<Fact-4>
CLIPS> (agenda)
0      pass-pass-pass-pass: *
For a total of 1 activation.
CLIPS> (assert (y) (w))
<Fact-6>
CLIPS> (agenda)
0      pass-fail-fail-pass: *
0      pass-pass-pass-pass: *
For a total of 2 activations.
CLIPS> (clear) ; Case 4j
CLIPS> (load* "attchtst4.clp")
TRUE
CLIPS> 
(defrule fail-pass-pass-fail "Case 4j"
   (exists (and (not (and (x)
                          (y)))
                (a)
                (test (= 1 1))))
   =>)
CLIPS> 
(defrule fail-fail-fail-fail "Case 4j"
   (exists (and (not (and (z)
                          (w)))
                (b)
                (test (!= 2 2))))
   =>)
CLIPS> (agenda)
CLIPS> (assert (a) (b))
<Fact-2>
CLIPS> (agenda)
0      fail-pass-pass-fail: *
For a total of 1 activation.
CLIPS> (assert (x) (z))
<Fact-4>
CLIPS> (agenda)
0      fail-pass-pass-fail: *
For a total of 1 activation.
CLIPS> (assert (y) (w))
<Fact-6>
CLIPS> (agenda)
CLIPS> (clear) ; Case 4k
CLIPS> (load* "attchtst4.clp")
TRUE
CLIPS> 
(defrule pass-fail-fail-fail "Case 4k"
   (exists (and (not (and (x)
                          (y)))
                (not (a))
                (test (= 1 1))))
   =>)
CLIPS> 
(defrule fail-fail-fail-fail "Case 4k"
   (exists (and (not (and (z)
                          (w)))
                (not (b))
                (test (!= 2 2))))
   =>)
CLIPS> (agenda)
0      pass-fail-fail-fail: *
For a total of 1 activation.
CLIPS> (assert (a) (b))
<Fact-2>
CLIPS> (agenda)
CLIPS> (assert (x) (z))
<Fact-4>
CLIPS> (agenda)
CLIPS> (assert (y) (w))
<Fact-6>
CLIPS> (agenda)
CLIPS> (clear) ; Case 4l
CLIPS> (load* "attchtst4.clp")
TRUE
CLIPS> 
(defrule fail-pass-pass-fail "Case 4l"
   (exists (and (not (and (x)
                          (y)))
                (exists (a))
                (test (= 1 1))))
   =>)
CLIPS> 
(defrule fail-fail-fail-fail "Case 4l"
   (exists (and (not (and (z)
                          (w)))
                (exists (b))
                (test (!= 2 2))))
   =>)
CLIPS> (agenda)
CLIPS> (assert (a) (b))
<Fact-2>
CLIPS> (agenda)
0      fail-pass-pass-fail: *
For a total of 1 activation.
CLIPS> (assert (x) (z))
<Fact-4>
CLIPS> (agenda)
0      fail-pass-pass-fail: *
For a total of 1 activation.
CLIPS> (assert (y) (w))
<Fact-6>
CLIPS> (agenda)
CLIPS> (clear) ; Case 5a
CLIPS> (load* "attchtst4.clp")
TRUE
CLIPS> 
(defrule fail-pass-fail "Case 5a"
   (a)
   (not (and (b)
             (test (= 1 1))))
   =>)
CLIPS> 
(defrule fail-pass-pass "Case 5a"
   (c)
   (not (and (d)
             (test (!= 2 2))))
   =>)
CLIPS> (agenda)
CLIPS> (assert (a) (c))
<Fact-2>
CLIPS> (agenda)
0      fail-pass-pass: f-2,*
0      fail-pass-fail: f-1,*
For a total of 2 activations.
CLIPS> (assert (b) (d))
<Fact-4>
CLIPS> (agenda)
0      fail-pass-pass: f-2,*
For a total of 1 activation.
CLIPS> (clear) ; Case 5b
CLIPS> (load* "attchtst4.clp")
TRUE
CLIPS> 
(defrule fail-fail-pass "Case 5b"
   (a)
   (not (and (not (b))
             (test (= 1 1))))
   =>)
CLIPS> 
(defrule fail-pass-pass "Case 5b"
   (c)
   (not (and (not (d))
             (test (!= 2 2))))
   =>)
CLIPS> (agenda)
CLIPS> (assert (a) (c))
<Fact-2>
CLIPS> (agenda)
0      fail-pass-pass: f-2,*
For a total of 1 activation.
CLIPS> (assert (b) (d))
<Fact-4>
CLIPS> (agenda)
0      fail-fail-pass: f-1,*
0      fail-pass-pass: f-2,*
For a total of 2 activations.
CLIPS> (clear) ; Case 5c
CLIPS> (load* "attchtst4.clp")
TRUE
CLIPS> 
(defrule fail-pass-fail "Case 5c"
   (a)
   (not (and (exists (b))
             (test (= 1 1))))
   =>)
CLIPS> 
(defrule fail-pass-pass "Case 5c"
   (c)
   (not (and (exists (d))
             (test (!= 2 2))))
   =>)
CLIPS> (agenda)
CLIPS> (assert (a) (c))
<Fact-2>
CLIPS> (agenda)
0      fail-pass-pass: f-2,*
0      fail-pass-fail: f-1,*
For a total of 2 activations.
CLIPS> (assert (b) (d))
<Fact-4>
CLIPS> (agenda)
0      fail-pass-pass: f-2,*
For a total of 1 activation.
CLIPS> (clear) ; Case 5d
CLIPS> (load* "attchtst4.clp")
TRUE
CLIPS> 
(defrule fail-fail-pass "Case 5d"
   (a)
   (exists (and (b)
                (test (= 1 1))))
   =>)
CLIPS> 
(defrule fail-fail-fail "Case 5d"
   (c)
   (exists (and (d)
                (test (!= 2 2))))
   =>)
CLIPS> (agenda)
CLIPS> (assert (a) (c))
<Fact-2>
CLIPS> (agenda)
CLIPS> (assert (b) (d))
<Fact-4>
CLIPS> (agenda)
0      fail-fail-pass: f-1,*
For a total of 1 activation.
CLIPS> (clear) ; Case 5e
CLIPS> (load* "attchtst4.clp")
TRUE
CLIPS> 
(defrule fail-pass-fail "Case 5e"
   (a)
   (exists (and (not (b))
                (test (= 1 1))))
   =>)
CLIPS> 
(defrule fail-fail-fail "Case 5e"
   (c)
   (exists (and (not (d))
                (test (!= 2 2))))
   =>)
CLIPS> (agenda)
CLIPS> (assert (a) (c))
<Fact-2>
CLIPS> (agenda)
0      fail-pass-fail: f-1,*
For a total of 1 activation.
CLIPS> (assert (b) (d))
<Fact-4>
CLIPS> (agenda)
CLIPS> (clear) ; Case 5f
CLIPS> (load* "attchtst4.clp")
TRUE
CLIPS> 
(defrule fail-fail-pass "Case 5f"
   (a)
   (exists (and (exists (b))
                (test (= 1 1))))
   =>)
CLIPS> 
(defrule fail-fail-fail "Case 5f"
   (c)
   (exists (and (exists (d))
                (test (!= 2 2))))
   =>)
CLIPS> (agenda)
CLIPS> (assert (a) (c))
<Fact-2>
CLIPS> (agenda)
CLIPS> (assert (b) (d))
<Fact-4>
CLIPS> (agenda)
0      fail-fail-pass: f-1,*
For a total of 1 activation.
CLIPS> (clear) ; Case 5g
CLIPS> (load* "attchtst4.clp")
TRUE
CLIPS> 
(defrule fail-pass-both "Case 5g"
   (a (sa ?x))
   (not (and (b (sb ?x))
             (test (> ?x 0))))
   =>)
CLIPS> 
(defrule fail-pass-pass "Case 5g"
   (c (sc ?x))
   (not (and (d (sd ?x))
             (test (< ?x 0))))
   =>)
CLIPS> (agenda)
CLIPS> (assert (a (sa 1)) (c (sc 1)) (a (sa 2)) (c (sc 2)))
<Fact-4>
CLIPS> (agenda)
0      fail-pass-pass: f-4,*
0      fail-pass-both: f-3,*
0      fail-pass-pass: f-2,*
0      fail-pass-both: f-1,*
For a total of 4 activations.
CLIPS> (assert (b (sb 1)) (d (sd 1)))
<Fact-6>
CLIPS> (agenda)
0      fail-pass-pass: f-4,*
0      fail-pass-both: f-3,*
0      fail-pass-pass: f-2,*
For a total of 3 activations.
CLIPS> (clear) ; Case 5h
CLIPS> (load* "attchtst4.clp")
TRUE
CLIPS> 
(defrule fail-fail-both "Case 5h"
   (a (sa ?x))
   (not (and (not (b (sb ?x)))
             (test (> ?x 0))))
   =>)
CLIPS> 
(defrule fail-pass-pass "Case 5h"
   (c (sc ?x))
   (not (and (not (d (sd ?x)))
             (test (< ?x 0))))
   =>)
CLIPS> (agenda)
CLIPS> (assert (a (sa 1)) (c (sc 1)) (a (sa 2)) (c (sc 2)))
<Fact-4>
CLIPS> (agenda)
0      fail-pass-pass: f-4,*
0      fail-pass-pass: f-2,*
For a total of 2 activations.
CLIPS> (assert (b (sb 1)) (d (sd 1)))
<Fact-6>
CLIPS> (agenda)
0      fail-fail-both: f-1,*
0      fail-pass-pass: f-4,*
0      fail-pass-pass: f-2,*
For a total of 3 activations.
CLIPS> (clear) ; Case 5i
CLIPS> (load* "attchtst4.clp")
TRUE
CLIPS> 
(defrule fail-pass-both "Case 5i"
   (a (sa ?x))
   (not (and (exists (b (sb ?x)))
             (test (> ?x 0))))
   =>)
CLIPS> 
(defrule fail-pass-pass "Case 5i"
   (c (sc ?x))
   (not (and (exists (d (sd ?x)))
             (test (< ?x 0))))
   =>)
CLIPS> (agenda)
CLIPS> (assert (a (sa 1)) (c (sc 1)) (a (sa 2)) (c (sc 2)))
<Fact-4>
CLIPS> (agenda)
0      fail-pass-pass: f-4,*
0      fail-pass-both: f-3,*
0      fail-pass-pass: f-2,*
0      fail-pass-both: f-1,*
For a total of 4 activations.
CLIPS> (assert (b (sb 1)) (d (sd 1)))
<Fact-6>
CLIPS> (agenda)
0      fail-pass-pass: f-4,*
0      fail-pass-both: f-3,*
0      fail-pass-pass: f-2,*
For a total of 3 activations.
CLIPS> (clear) ; Case 5j
CLIPS> (load* "attchtst4.clp")
TRUE
CLIPS> 
(defrule fail-fail-both "Case 5j"
   (a (sa ?x))
   (exists (and (b (sb ?x))
                (test (> ?x 0))))
   =>)
CLIPS> 
(defrule fail-fail-fail "Case 5j"
   (c (sc ?x))
   (exists (and (d (sd ?x))
                (test (< ?x 0))))
   =>)
CLIPS> (agenda)
CLIPS> (assert (a (sa 1)) (c (sc 1)) (a (sa 2)) (c (sc 2)))
<Fact-4>
CLIPS> (agenda)
CLIPS> (assert (b (sb 1)) (d (sd 1)))
<Fact-6>
CLIPS> (agenda)
0      fail-fail-both: f-1,*
For a total of 1 activation.
CLIPS> (clear) ; Case 5k
CLIPS> (load* "attchtst4.clp")
TRUE
CLIPS> 
(defrule fail-pass-both "Case 5k"
   (a (sa ?x))
   (exists (and (not (b (sb ?x)))
                (test (> ?x 0))))
   =>)
CLIPS> 
(defrule fail-fail-fail "Case 5k"
   (c (sc ?x))
   (exists (and (not (d (sd ?x)))
                (test (< ?x 0))))
   =>)
CLIPS> (agenda)
CLIPS> (assert (a (sa 1)) (c (sc 1)) (a (sa 2)) (c (sc 2)))
<Fact-4>
CLIPS> (agenda)
0      fail-pass-both: f-3,*
0      fail-pass-both: f-1,*
For a total of 2 activations.
CLIPS> (assert (b (sb 1)) (d (sd 1)))
<Fact-6>
CLIPS> (agenda)
0      fail-pass-both: f-3,*
For a total of 1 activation.
CLIPS> (clear) ; Case 5l
CLIPS> (load* "attchtst4.clp")
TRUE
CLIPS> 
(defrule fail-fail-both "Case 5l"
   (a (sa ?x))
   (exists (and (exists (b (sb ?x)))
                (test (> ?x 0))))
   =>)
CLIPS> 
(defrule fail-fail-fail "Case 5l"
   (c (sc ?x))
   (exists (and (exists (d (sd ?x)))
                (test (< ?x 0))))
   =>)
CLIPS> (agenda)
CLIPS> (assert (a (sa 1)) (c (sc 1)) (a (sa 2)) (c (sc 2)))
<Fact-4>
CLIPS> (agenda)
CLIPS> (assert (b (sb 1)) (d (sd 1)))
<Fact-6>
CLIPS> (agenda)
0      fail-fail-both: f-1,*
For a total of 1 activation.
CLIPS> (clear) ; Case 5m
CLIPS> (load* "attchtst4.clp")
TRUE
CLIPS> 
(defrule fail-pass-pass-pass "Case 5m"
   (not (and (not (and (a)
                       (b)))
             (not (and (c)
                       (test (= 1 1))))))
   =>)
CLIPS> 
(defrule fail-fail-fail-pass "Case 5m"
   (not (and (not (and (d)
                       (e)))
             (not (and (f)
                       (test (!= 2 2))))))
   =>)
CLIPS> (agenda)
CLIPS> (assert (c) (f))
<Fact-2>
CLIPS> (agenda)
0      fail-pass-pass-pass: *
For a total of 1 activation.
CLIPS> (assert (a) (d))
<Fact-4>
CLIPS> (agenda)
0      fail-pass-pass-pass: *
For a total of 1 activation.
CLIPS> (assert (b) (e))
<Fact-6>
CLIPS> (agenda)
0      fail-fail-fail-pass: *
0      fail-pass-pass-pass: *
For a total of 2 activations.
CLIPS> (clear) ; Case 5n
CLIPS> (load* "attchtst4.clp")
TRUE
CLIPS> 
(defrule pass-fail-fail-pass "Case 5n"
   (not (and (not (and (a)
                       (b)))
             (exists (and (c)
                          (test (= 1 1))))))
   =>)
CLIPS> 
(defrule pass-pass-pass-pass "Case 5n"
   (not (and (not (and (d)
                       (e)))
             (exists (and (f)
                          (test (!= 2 2))))))
   =>)
CLIPS> (agenda)
0      pass-pass-pass-pass: *
0      pass-fail-fail-pass: *
For a total of 2 activations.
CLIPS> (assert (c) (f))
<Fact-2>
CLIPS> (agenda)
0      pass-pass-pass-pass: *
For a total of 1 activation.
CLIPS> (assert (a) (d))
<Fact-4>
CLIPS> (agenda)
0      pass-pass-pass-pass: *
For a total of 1 activation.
CLIPS> (assert (b) (e))
<Fact-6>
CLIPS> (agenda)
0      pass-fail-fail-pass: *
0      pass-pass-pass-pass: *
For a total of 2 activations.
CLIPS> (clear) ; Case 5o
CLIPS> (load* "attchtst4.clp")
TRUE
CLIPS> 
(defrule fail-pass-both "Case 5o"
   (x)
   (a (sa ?x))
   (not (and (b (sb ?x))
             (test (> ?x 0))))
   =>)
CLIPS> 
(defrule fail-pass-pass "Case 5o"
   (x)
   (c (sc ?x))
   (not (and (d (sd ?x))
             (test (< ?x 0))))
   =>)
CLIPS> (assert (x))
<Fact-1>
CLIPS> (agenda)
CLIPS> (assert (a (sa 1)) (c (sc 1)) (a (sa 2)) (c (sc 2)))
<Fact-5>
CLIPS> (agenda)
0      fail-pass-pass: f-1,f-5,*
0      fail-pass-both: f-1,f-4,*
0      fail-pass-pass: f-1,f-3,*
0      fail-pass-both: f-1,f-2,*
For a total of 4 activations.
CLIPS> (assert (b (sb 1)) (d (sd 1)))
<Fact-7>
CLIPS> (agenda)
0      fail-pass-pass: f-1,f-5,*
0      fail-pass-both: f-1,f-4,*
0      fail-pass-pass: f-1,f-3,*
For a total of 3 activations.
CLIPS> (clear) ; Case 5p
CLIPS> (load* "attchtst4.clp")
TRUE
CLIPS> 
(defrule fail-fail-both "Case 5p"
   (x)
   (a (sa ?x))
   (not (and (not (b (sb ?x)))
             (test (> ?x 0))))
   =>)
CLIPS> 
(defrule fail-pass-pass "Case 5p"
   (x)
   (c (sc ?x))
   (not (and (not (d (sd ?x)))
             (test (< ?x 0))))
   =>)
CLIPS> (assert (x))
<Fact-1>
CLIPS> (agenda)
CLIPS> (assert (a (sa 1)) (c (sc 1)) (a (sa 2)) (c (sc 2)))
<Fact-5>
CLIPS> (agenda)
0      fail-pass-pass: f-1,f-5,*
0      fail-pass-pass: f-1,f-3,*
For a total of 2 activations.
CLIPS> (assert (b (sb 1)) (d (sd 1)))
<Fact-7>
CLIPS> (agenda)
0      fail-fail-both: f-1,f-2,*
0      fail-pass-pass: f-1,f-5,*
0      fail-pass-pass: f-1,f-3,*
For a total of 3 activations.
CLIPS> (clear) ; Case 5q
CLIPS> (load* "attchtst4.clp")
TRUE
CLIPS> 
(defrule fail-pass-both "Case 5q"
   (x)
   (a (sa ?x))
   (not (and (exists (b (sb ?x)))
             (test (> ?x 0))))
   =>)
CLIPS> 
(defrule fail-pass-pass "Case 5q"
   (x)
   (c (sc ?x))
   (not (and (exists (d (sd ?x)))
             (test (< ?x 0))))
   =>)
CLIPS> (assert (x))
<Fact-1>
CLIPS> (agenda)
CLIPS> (assert (a (sa 1)) (c (sc 1)) (a (sa 2)) (c (sc 2)))
<Fact-5>
CLIPS> (agenda)
0      fail-pass-pass: f-1,f-5,*
0      fail-pass-both: f-1,f-4,*
0      fail-pass-pass: f-1,f-3,*
0      fail-pass-both: f-1,f-2,*
For a total of 4 activations.
CLIPS> (assert (b (sb 1)) (d (sd 1)))
<Fact-7>
CLIPS> (agenda)
0      fail-pass-pass: f-1,f-5,*
0      fail-pass-both: f-1,f-4,*
0      fail-pass-pass: f-1,f-3,*
For a total of 3 activations.
CLIPS> (clear) ; Case 5r
CLIPS> (load* "attchtst4.clp")
TRUE
CLIPS> 
(defrule fail-fail-both "Case 5r"
   (x)
   (a (sa ?x))
   (exists (and (b (sb ?x))
                (test (> ?x 0))))
   =>)
CLIPS> 
(defrule fail-fail-fail "Case 5r"
   (x)
   (c (sc ?x))
   (exists (and (d (sd ?x))
                (test (< ?x 0))))
   =>)
CLIPS> (assert (x))
<Fact-1>
CLIPS> (agenda)
CLIPS> (assert (a (sa 1)) (c (sc 1)) (a (sa 2)) (c (sc 2)))
<Fact-5>
CLIPS> (agenda)
CLIPS> (assert (b (sb 1)) (d (sd 1)))
<Fact-7>
CLIPS> (agenda)
0      fail-fail-both: f-1,f-2,*
For a total of 1 activation.
CLIPS> (clear) ; Case 5s
CLIPS> (load* "attchtst4.clp")
TRUE
CLIPS> 
(defrule fail-pass-both "Case 5s"
   (x)
   (a (sa ?x))
   (exists (and (not (b (sb ?x)))
                (test (> ?x 0))))
   =>)
CLIPS> 
(defrule fail-fail-fail "Case 5s"
   (x)
   (c (sc ?x))
   (exists (and (not (d (sd ?x)))
                (test (< ?x 0))))
   =>)
CLIPS> (assert (x))
<Fact-1>
CLIPS> (agenda)
CLIPS> (assert (a (sa 1)) (c (sc 1)) (a (sa 2)) (c (sc 2)))
<Fact-5>
CLIPS> (agenda)
0      fail-pass-both: f-1,f-4,*
0      fail-pass-both: f-1,f-2,*
For a total of 2 activations.
CLIPS> (assert (b (sb 1)) (d (sd 1)))
<Fact-7>
CLIPS> (agenda)
0      fail-pass-both: f-1,f-4,*
For a total of 1 activation.
CLIPS> (clear) ; Case 5t
CLIPS> (load* "attchtst4.clp")
TRUE
CLIPS> 
(defrule fail-fail-both "Case 5t"
   (x)
   (a (sa ?x))
   (exists (and (exists (b (sb ?x)))
                (test (> ?x 0))))
   =>)
CLIPS> 
(defrule fail-fail-fail "Case 5t"
   (x)
   (c (sc ?x))
   (exists (and (exists (d (sd ?x)))
                (test (< ?x 0))))
   =>)
CLIPS> (assert (x))
<Fact-1>
CLIPS> (agenda)
CLIPS> (assert (a (sa 1)) (c (sc 1)) (a (sa 2)) (c (sc 2)))
<Fact-5>
CLIPS> (agenda)
CLIPS> (assert (b (sb 1)) (d (sd 1)))
<Fact-7>
CLIPS> (agenda)
0      fail-fail-both: f-1,f-2,*
For a total of 1 activation.
CLIPS> (clear) ; Case 6a
CLIPS> (load* "attchtst4.clp")
TRUE
CLIPS> 
(defrule fail-pass-fail-fail-pass "Case 6a"
   (a)
   (not (and (not (and (b)
                       (c)))
             (test (= 1 1))
             (d)))
   =>)
CLIPS> 
(defrule fail-pass-pass-pass-pass "Case 6a"
   (e)
   (not (and (not (and (f)
                       (g)))
             (test (!= 2 2))
             (h)))
   =>)
CLIPS> (agenda)
CLIPS> (assert (a) (e))
<Fact-2>
CLIPS> (agenda)
0      fail-pass-pass-pass-pass: f-2,*
0      fail-pass-fail-fail-pass: f-1,*
For a total of 2 activations.
CLIPS> (assert (d) (h))
<Fact-4>
CLIPS> (agenda)
0      fail-pass-pass-pass-pass: f-2,*
For a total of 1 activation.
CLIPS> (assert (b) (f))
<Fact-6>
CLIPS> (agenda)
0      fail-pass-pass-pass-pass: f-2,*
For a total of 1 activation.
CLIPS> (assert (c) (g))
<Fact-8>
CLIPS> (agenda)
0      fail-pass-fail-fail-pass: f-1,*
0      fail-pass-pass-pass-pass: f-2,*
For a total of 2 activations.
CLIPS> (clear) ; Case 6b
CLIPS> (load* "attchtst4.clp")
TRUE
CLIPS> 
(defrule fail-pass-pass-pass-fail "Case 6b"
   (a)
   (not (and (exists (and (b)
                          (c)))
             (test (= 1 1))
             (d)))
   =>)
CLIPS> 
(defrule fail-pass-pass-pass-pass "Case 6b"
   (e)
   (not (and (exists (and (f)
                          (g)))
             (test (!= 2 2))
             (h)))
   =>)
CLIPS> (agenda)
CLIPS> (assert (a) (e))
<Fact-2>
CLIPS> (agenda)
0      fail-pass-pass-pass-pass: f-2,*
0      fail-pass-pass-pass-fail: f-1,*
For a total of 2 activations.
CLIPS> (assert (d) (h))
<Fact-4>
CLIPS> (agenda)
0      fail-pass-pass-pass-pass: f-2,*
0      fail-pass-pass-pass-fail: f-1,*
For a total of 2 activations.
CLIPS> (assert (b) (f))
<Fact-6>
CLIPS> (agenda)
0      fail-pass-pass-pass-pass: f-2,*
0      fail-pass-pass-pass-fail: f-1,*
For a total of 2 activations.
CLIPS> (assert (c) (g))
<Fact-8>
CLIPS> (agenda)
0      fail-pass-pass-pass-pass: f-2,*
For a total of 1 activation.
CLIPS> (clear) ; Case 6c
CLIPS> (load* "attchtst4.clp")
TRUE
CLIPS> 
(defrule fail-fail-pass-pass-fail "Case 6c"
   (a)
   (exists (and (not (and (b)
                          (c)))
                (test (= 1 1))
                (d)))
   =>)
CLIPS> 
(defrule fail-fail-fail-fail-fail "Case 6c"
   (e)
   (exists (and (not (and (f)
                          (g)))
                (test (!= 2 2))
                (h)))
   =>)
CLIPS> (agenda)
CLIPS> (assert (a) (e))
<Fact-2>
CLIPS> (agenda)
CLIPS> (assert (d) (h))
<Fact-4>
CLIPS> (agenda)
0      fail-fail-pass-pass-fail: f-1,*
For a total of 1 activation.
CLIPS> (assert (b) (f))
<Fact-6>
CLIPS> (agenda)
0      fail-fail-pass-pass-fail: f-1,*
For a total of 1 activation.
CLIPS> (assert (c) (g))
<Fact-8>
CLIPS> (agenda)
CLIPS> (clear) ; Case 6d
CLIPS> (load* "attchtst4.clp")
TRUE
CLIPS> 
(defrule fail-fail-fail-fail-pass "Case 6d"
   (a)
   (exists (and (exists (and (b)
                             (c)))
                (test (= 1 1))
                (d)))
   =>)
CLIPS> 
(defrule fail-fail-fail-fail-fail "Case 6d"
   (e)
   (exists (and (exists (and (f)
                             (g)))
                (test (!= 2 2))
                (h)))
   =>)
CLIPS> (agenda)
CLIPS> (assert (a) (e))
<Fact-2>
CLIPS> (agenda)
CLIPS> (assert (d) (h))
<Fact-4>
CLIPS> (agenda)
CLIPS> (assert (b) (f))
<Fact-6>
CLIPS> (agenda)
CLIPS> (assert (c) (g))
<Fact-8>
CLIPS> (agenda)
0      fail-fail-fail-fail-pass: f-1,*
For a total of 1 activation.
CLIPS> (clear) ; Case 6e
CLIPS> (load* "attchtst4.clp")
TRUE
CLIPS> 
(defrule fail-pass-fail-fail-both "Case 6e"
   (a (sa ?x))
   (not (and (not (and (b (sb ?x))
                       (c (sc ?x))))
             (test (= 1 1))
             (d (sd ?x))))
   =>)
CLIPS> 
(defrule fail-pass-pass-pass-pass "Case 6e"
   (e (se ?x))
   (not (and (not (and (f (sf ?x))
                       (g (sg ?x))))
             (test (!= 2 2))
             (h (sh ?x))))
   =>)
CLIPS> (agenda)
CLIPS> (assert (a (sa 1)) (e (se 1)) (a (sa 2)) (e (se 2)))
<Fact-4>
CLIPS> (agenda)
0      fail-pass-pass-pass-pass: f-4,*
0      fail-pass-fail-fail-both: f-3,*
0      fail-pass-pass-pass-pass: f-2,*
0      fail-pass-fail-fail-both: f-1,*
For a total of 4 activations.
CLIPS> (assert (d (sd 1)) (h (sh 1)) (d (sd 2)) (h (sh 2)))
<Fact-8>
CLIPS> (agenda)
0      fail-pass-pass-pass-pass: f-4,*
0      fail-pass-pass-pass-pass: f-2,*
For a total of 2 activations.
CLIPS> (assert (b (sb 1)) (f (sf 1)))
<Fact-10>
CLIPS> (agenda)
0      fail-pass-pass-pass-pass: f-4,*
0      fail-pass-pass-pass-pass: f-2,*
For a total of 2 activations.
CLIPS> (assert (c (sc 1)) (g (sg 1)))
<Fact-12>
CLIPS> (agenda)
0      fail-pass-fail-fail-both: f-1,*
0      fail-pass-pass-pass-pass: f-4,*
0      fail-pass-pass-pass-pass: f-2,*
For a total of 3 activations.
CLIPS> (clear) ; Case 6f
CLIPS> (load* "attchtst4.clp")
TRUE
CLIPS> 
(defrule fail-pass-pass-pass-both "Case 6f"
   (a (sa ?x))
   (not (and (exists (and (b (sb ?x))
                          (c (sc ?x))))
             (test (= 1 1))
             (d (sd ?x))))
   =>)
CLIPS> 
(defrule fail-pass-pass-pass-pass "Case 6f"
   (e (se ?x))
   (not (and (exists (and (f (sf ?x))
                          (g (sg ?x))))
             (test (!= 2 2))
             (h (sh ?x))))
   =>)
CLIPS> (agenda)
CLIPS> (assert (a (sa 1)) (e (se 1)) (a (sa 2)) (e (se 2)))
<Fact-4>
CLIPS> (agenda)
0      fail-pass-pass-pass-pass: f-4,*
0      fail-pass-pass-pass-both: f-3,*
0      fail-pass-pass-pass-pass: f-2,*
0      fail-pass-pass-pass-both: f-1,*
For a total of 4 activations.
CLIPS> (assert (d (sd 1)) (h (sh 1)) (d (sd 2)) (h (sh 2)))
<Fact-8>
CLIPS> (agenda)
0      fail-pass-pass-pass-pass: f-4,*
0      fail-pass-pass-pass-both: f-3,*
0      fail-pass-pass-pass-pass: f-2,*
0      fail-pass-pass-pass-both: f-1,*
For a total of 4 activations.
CLIPS> (assert (b (sb 1)) (f (sf 1)))
<Fact-10>
CLIPS> (agenda)
0      fail-pass-pass-pass-pass: f-4,*
0      fail-pass-pass-pass-both: f-3,*
0      fail-pass-pass-pass-pass: f-2,*
0      fail-pass-pass-pass-both: f-1,*
For a total of 4 activations.
CLIPS> (assert (c (sc 1)) (g (sg 1)))
<Fact-12>
CLIPS> (agenda)
0      fail-pass-pass-pass-pass: f-4,*
0      fail-pass-pass-pass-both: f-3,*
0      fail-pass-pass-pass-pass: f-2,*
For a total of 3 activations.
CLIPS> (clear) ; Case 6g
CLIPS> (load* "attchtst4.clp")
TRUE
CLIPS> 
(defrule fail-fail-pass-pass-both "Case 6g"
   (a (sa ?x))
   (exists (and (not (and (b (sb ?x))
                          (c (sc ?x))))
                (test (= 1 1))
                (d (sd ?x))))
   =>)
CLIPS> 
(defrule fail-fail-fail-fail-fail "Case 6g"
   (e (se ?x))
   (exists (and (not (and (f (sf ?x))
                          (g (sg ?x))))
                (test (!= 2 2))
                (h (sh ?x))))
   =>)
CLIPS> (agenda)
CLIPS> (assert (a (sa 1)) (e (se 1)) (a (sa 2)) (e (se 2)))
<Fact-4>
CLIPS> (agenda)
CLIPS> (assert (d (sd 1)) (h (sh 1)) (d (sd 2)) (h (sh 2)))
<Fact-8>
CLIPS> (agenda)
0      fail-fail-pass-pass-both: f-3,*
0      fail-fail-pass-pass-both: f-1,*
For a total of 2 activations.
CLIPS> (assert (b (sb 1)) (f (sf 1)))
<Fact-10>
CLIPS> (agenda)
0      fail-fail-pass-pass-both: f-3,*
0      fail-fail-pass-pass-both: f-1,*
For a total of 2 activations.
CLIPS> (assert (c (sc 1)) (g (sg 1)))
<Fact-12>
CLIPS> (agenda)
0      fail-fail-pass-pass-both: f-3,*
For a total of 1 activation.
CLIPS> (clear) ; Case 6h
CLIPS> (load* "attchtst4.clp")
TRUE
CLIPS> 
(defrule fail-fail-fail-fail-both "Case 6h"
   (a (sa ?x))
   (exists (and (exists (and (b (sb ?x))
                             (c (sc ?x))))
                (test (= 1 1))
                (d (sd ?x))))
   =>)
CLIPS> 
(defrule fail-fail-fail-fail-fail "Case 6h"
   (e (se ?x))
   (exists (and (exists (and (f (sf ?x))
                             (g (sg ?x))))
                (test (!= 2 2))
                (h (sh ?x))))
   =>)
CLIPS> (agenda)
CLIPS> (assert (a (sa 1)) (e (se 1)) (a (sa 2)) (e (se 2)))
<Fact-4>
CLIPS> (agenda)
CLIPS> (assert (d (sd 1)) (h (sh 1)) (d (sd 2)) (h (sh 2)))
<Fact-8>
CLIPS> (agenda)
CLIPS> (assert (b (sb 1)) (f (sf 1)))
<Fact-10>
CLIPS> (agenda)
CLIPS> (assert (c (sc 1)) (g (sg 1)))
<Fact-12>
CLIPS> (agenda)
0      fail-fail-fail-fail-both: f-1,*
For a total of 1 activation.
CLIPS> (clear) ; Case 6i
CLIPS> (load* "attchtst4.clp")
TRUE
CLIPS> 
(defrule fail-pass-fail-fail-both "Case 6i"
   (x)
   (a (sa ?x))
   (not (and (not (and (b (sb ?x))
                       (c (sc ?x))))
             (test (= 1 1))
             (d (sd ?x))))
   =>)
CLIPS> 
(defrule fail-pass-pass-pass-pass "Case 6i"
   (x)
   (e (se ?x))
   (not (and (not (and (f (sf ?x))
                       (g (sg ?x))))
             (test (!= 2 2))
             (h (sh ?x))))
   =>)
CLIPS> (assert (x))
<Fact-1>
CLIPS> (agenda)
CLIPS> (assert (a (sa 1)) (e (se 1)) (a (sa 2)) (e (se 2)))
<Fact-5>
CLIPS> (agenda)
0      fail-pass-pass-pass-pass: f-1,f-5,*
0      fail-pass-fail-fail-both: f-1,f-4,*
0      fail-pass-pass-pass-pass: f-1,f-3,*
0      fail-pass-fail-fail-both: f-1,f-2,*
For a total of 4 activations.
CLIPS> (assert (d (sd 1)) (h (sh 1)) (d (sd 2)) (h (sh 2)))
<Fact-9>
CLIPS> (agenda)
0      fail-pass-pass-pass-pass: f-1,f-5,*
0      fail-pass-pass-pass-pass: f-1,f-3,*
For a total of 2 activations.
CLIPS> (assert (b (sb 1)) (f (sf 1)))
<Fact-11>
CLIPS> (agenda)
0      fail-pass-pass-pass-pass: f-1,f-5,*
0      fail-pass-pass-pass-pass: f-1,f-3,*
For a total of 2 activations.
CLIPS> (assert (c (sc 1)) (g (sg 1)))
<Fact-13>
CLIPS> (agenda)
0      fail-pass-fail-fail-both: f-1,f-2,*
0      fail-pass-pass-pass-pass: f-1,f-5,*
0      fail-pass-pass-pass-pass: f-1,f-3,*
For a total of 3 activations.
CLIPS> (clear) ; Case 6j
CLIPS> (load* "attchtst4.clp")
TRUE
CLIPS> 
(defrule fail-pass-pass-pass-both "Case 6j"
   (x)
   (a (sa ?x))
   (not (and (exists (and (b (sb ?x))
                          (c (sc ?x))))
             (test (= 1 1))
             (d (sd ?x))))
   =>)
CLIPS> 
(defrule fail-pass-pass-pass-pass "Case 6j"
   (x)
   (e (se ?x))
   (not (and (exists (and (f (sf ?x))
                          (g (sg ?x))))
             (test (!= 2 2))
             (h (sh ?x))))
   =>)
CLIPS> (assert (x))
<Fact-1>
CLIPS> (agenda)
CLIPS> (assert (a (sa 1)) (e (se 1)) (a (sa 2)) (e (se 2)))
<Fact-5>
CLIPS> (agenda)
0      fail-pass-pass-pass-pass: f-1,f-5,*
0      fail-pass-pass-pass-both: f-1,f-4,*
0      fail-pass-pass-pass-pass: f-1,f-3,*
0      fail-pass-pass-pass-both: f-1,f-2,*
For a total of 4 activations.
CLIPS> (assert (d (sd 1)) (h (sh 1)) (d (sd 2)) (h (sh 2)))
<Fact-9>
CLIPS> (agenda)
0      fail-pass-pass-pass-pass: f-1,f-5,*
0      fail-pass-pass-pass-both: f-1,f-4,*
0      fail-pass-pass-pass-pass: f-1,f-3,*
0      fail-pass-pass-pass-both: f-1,f-2,*
For a total of 4 activations.
CLIPS> (assert (b (sb 1)) (f (sf 1)))
<Fact-11>
CLIPS> (agenda)
0      fail-pass-pass-pass-pass: f-1,f-5,*
0      fail-pass-pass-pass-both: f-1,f-4,*
0      fail-pass-pass-pass-pass: f-1,f-3,*
0      fail-pass-pass-pass-both: f-1,f-2,*
For a total of 4 activations.
CLIPS> (assert (c (sc 1)) (g (sg 1)))
<Fact-13>
CLIPS> (agenda)
0      fail-pass-pass-pass-pass: f-1,f-5,*
0      fail-pass-pass-pass-both: f-1,f-4,*
0      fail-pass-pass-pass-pass: f-1,f-3,*
For a total of 3 activations.
CLIPS> (clear) ; Case 6k
CLIPS> (load* "attchtst4.clp")
TRUE
CLIPS> 
(defrule fail-fail-pass-pass-both "Case 6k"
   (x)
   (a (sa ?x))
   (exists (and (not (and (b (sb ?x))
                          (c (sc ?x))))
                (test (= 1 1))
                (d (sd ?x))))
   =>)
CLIPS> 
(defrule fail-fail-fail-fail-fail "Case 6k"
   (x)
   (e (se ?x))
   (exists (and (not (and (f (sf ?x))
                          (g (sg ?x))))
                (test (!= 2 2))
                (h (sh ?x))))
   =>)
CLIPS> (assert (x))
<Fact-1>
CLIPS> (agenda)
CLIPS> (assert (a (sa 1)) (e (se 1)) (a (sa 2)) (e (se 2)))
<Fact-5>
CLIPS> (agenda)
CLIPS> (assert (d (sd 1)) (h (sh 1)) (d (sd 2)) (h (sh 2)))
<Fact-9>
CLIPS> (agenda)
0      fail-fail-pass-pass-both: f-1,f-4,*
0      fail-fail-pass-pass-both: f-1,f-2,*
For a total of 2 activations.
CLIPS> (assert (b (sb 1)) (f (sf 1)))
<Fact-11>
CLIPS> (agenda)
0      fail-fail-pass-pass-both: f-1,f-4,*
0      fail-fail-pass-pass-both: f-1,f-2,*
For a total of 2 activations.
CLIPS> (assert (c (sc 1)) (g (sg 1)))
<Fact-13>
CLIPS> (agenda)
0      fail-fail-pass-pass-both: f-1,f-4,*
For a total of 1 activation.
CLIPS> (clear) ; Case 6l
CLIPS> (load* "attchtst4.clp")
TRUE
CLIPS> 
(defrule fail-fail-fail-fail-both "Case 6l"
   (x)
   (a (sa ?x))
   (exists (and (exists (and (b (sb ?x))
                             (c (sc ?x))))
                (test (= 1 1))
                (d (sd ?x))))
   =>)
CLIPS> 
(defrule fail-fail-fail-fail-fail "Case 6l"
   (x)
   (e (se ?x))
   (exists (and (exists (and (f (sf ?x))
                             (g (sg ?x))))
                (test (!= 2 2))
                (h (sh ?x))))
   =>)
CLIPS> (assert (x))
<Fact-1>
CLIPS> (agenda)
CLIPS> (assert (a (sa 1)) (e (se 1)) (a (sa 2)) (e (se 2)))
<Fact-5>
CLIPS> (agenda)
CLIPS> (assert (d (sd 1)) (h (sh 1)) (d (sd 2)) (h (sh 2)))
<Fact-9>
CLIPS> (agenda)
CLIPS> (assert (b (sb 1)) (f (sf 1)))
<Fact-11>
CLIPS> (agenda)
CLIPS> (assert (c (sc 1)) (g (sg 1)))
<Fact-13>
CLIPS> (agenda)
0      fail-fail-fail-fail-both: f-1,f-2,*
For a total of 1 activation.
CLIPS> (clear) ; Case 7a
CLIPS> (load* "attchtst4.clp")
TRUE
CLIPS> 
(defrule fail-fail-fail-pass "Case 7a"
   (a)
   (not (and (not (and (b)
                       (c)))
             (test (= 1 1))))
   =>)
CLIPS> 
(defrule fail-pass-pass-pass "Case 7a"
   (e)
   (not (and (not (and (f)
                       (g)))
             (test (!= 2 2))))
   =>)
CLIPS> (agenda)
CLIPS> (assert (a) (e))
<Fact-2>
CLIPS> (agenda)
0      fail-pass-pass-pass: f-2,*
For a total of 1 activation.
CLIPS> (assert (b) (f))
<Fact-4>
CLIPS> (agenda)
0      fail-pass-pass-pass: f-2,*
For a total of 1 activation.
CLIPS> (assert (c) (g))
<Fact-6>
CLIPS> (agenda)
0      fail-fail-fail-pass: f-1,*
0      fail-pass-pass-pass: f-2,*
For a total of 2 activations.
CLIPS> (clear) ; Case 7b
CLIPS> (load* "attchtst4.clp")
TRUE
CLIPS> 
(defrule fail-pass-pass-fail "Case 7b"
   (a)
   (not (and (exists (and (b)
                          (c)))
             (test (= 1 1))))
   =>)
CLIPS> 
(defrule fail-pass-pass-pass "Case 7b"
   (e)
   (not (and (exists (and (f)
                          (g)))
             (test (!= 2 2))))
   =>)
CLIPS> (agenda)
CLIPS> (assert (a) (e))
<Fact-2>
CLIPS> (agenda)
0      fail-pass-pass-pass: f-2,*
0      fail-pass-pass-fail: f-1,*
For a total of 2 activations.
CLIPS> (assert (b) (f))
<Fact-4>
CLIPS> (agenda)
0      fail-pass-pass-pass: f-2,*
0      fail-pass-pass-fail: f-1,*
For a total of 2 activations.
CLIPS> (assert (c) (g))
<Fact-6>
CLIPS> (agenda)
0      fail-pass-pass-pass: f-2,*
For a total of 1 activation.
CLIPS> (clear) ; Case 7c
CLIPS> (load* "attchtst4.clp")
TRUE
CLIPS> 
(defrule fail-pass-pass-fail "Case 7c"
   (a)
   (exists (and (not (and (b)
                          (c)))
                (test (= 1 1))))
   =>)
CLIPS> 
(defrule fail-fail-fail-fail "Case 7c"
   (e)
   (exists (and (not (and (f)
                          (g)))
                (test (!= 2 2))))
   =>)
CLIPS> (agenda)
CLIPS> (assert (a) (e))
<Fact-2>
CLIPS> (agenda)
0      fail-pass-pass-fail: f-1,*
For a total of 1 activation.
CLIPS> (assert (b) (f))
<Fact-4>
CLIPS> (agenda)
0      fail-pass-pass-fail: f-1,*
For a total of 1 activation.
CLIPS> (assert (c) (g))
<Fact-6>
CLIPS> (agenda)
CLIPS> (clear) ; Case 7d
CLIPS> (load* "attchtst4.clp")
TRUE
CLIPS> 
(defrule fail-fail-fail-pass "Case 7d"
   (a)
   (exists (and (exists (and (b)
                             (c)))
                (test (= 1 1))))
   =>)
CLIPS> 
(defrule fail-fail-fail-fail "Case 7d"
   (e)
   (exists (and (exists (and (f)
                             (g)))
                (test (!= 2 2))))
   =>)
CLIPS> (agenda)
CLIPS> (assert (a) (e))
<Fact-2>
CLIPS> (agenda)
CLIPS> (assert (b) (f))
<Fact-4>
CLIPS> (agenda)
CLIPS> (assert (c) (g))
<Fact-6>
CLIPS> (agenda)
0      fail-fail-fail-pass: f-1,*
For a total of 1 activation.
CLIPS> (clear) ; Case 7e
CLIPS> (load* "attchtst4.clp")
TRUE
CLIPS> 
(defrule fail-fail-fail-both "Case 7e"
   (a (sa ?x))
   (not (and (not (and (b (sb ?x))
                       (c (sc ?x))))
             (test (= 1 1))))
   =>)
CLIPS> 
(defrule fail-pass-pass-pass "Case 7e"
   (e (se ?x))
   (not (and (not (and (f (sf ?x))
                       (g (sg ?x))))
             (test (!= 2 2))))
   =>)
CLIPS> (agenda)
CLIPS> (assert (a (sa 1)) (e (se 1)) (a (sa 2)) (e (se 2)))
<Fact-4>
CLIPS> (agenda)
0      fail-pass-pass-pass: f-4,*
0      fail-pass-pass-pass: f-2,*
For a total of 2 activations.
CLIPS> (assert (b (sb 1)) (f (sf 1)))
<Fact-6>
CLIPS> (agenda)
0      fail-pass-pass-pass: f-4,*
0      fail-pass-pass-pass: f-2,*
For a total of 2 activations.
CLIPS> (assert (c (sc 1)) (g (sg 1)))
<Fact-8>
CLIPS> (agenda)
0      fail-fail-fail-both: f-1,*
0      fail-pass-pass-pass: f-4,*
0      fail-pass-pass-pass: f-2,*
For a total of 3 activations.
CLIPS> (clear) ; Case 7f
CLIPS> (load* "attchtst4.clp")
TRUE
CLIPS> 
(defrule fail-pass-pass-both "Case 7f"
   (a (sa ?x))
   (not (and (exists (and (b (sb ?x))
                          (c (sc ?x))))
             (test (= 1 1))))
   =>)
CLIPS> 
(defrule fail-pass-pass-pass "Case 7f"
   (e (se ?x))
   (not (and (exists (and (f (sf ?x))
                          (g (sg ?x))))
             (test (!= 2 2))))
   =>)
CLIPS> (agenda)
CLIPS> (assert (a (sa 1)) (e (se 1)) (a (sa 2)) (e (se 2)))
<Fact-4>
CLIPS> (agenda)
0      fail-pass-pass-pass: f-4,*
0      fail-pass-pass-both: f-3,*
0      fail-pass-pass-pass: f-2,*
0      fail-pass-pass-both: f-1,*
For a total of 4 activations.
CLIPS> (assert (b (sb 1)) (f (sf 1)))
<Fact-6>
CLIPS> (agenda)
0      fail-pass-pass-pass: f-4,*
0      fail-pass-pass-both: f-3,*
0      fail-pass-pass-pass: f-2,*
0      fail-pass-pass-both: f-1,*
For a total of 4 activations.
CLIPS> (assert (c (sc 1)) (g (sg 1)))
<Fact-8>
CLIPS> (agenda)
0      fail-pass-pass-pass: f-4,*
0      fail-pass-pass-both: f-3,*
0      fail-pass-pass-pass: f-2,*
For a total of 3 activations.
CLIPS> (clear) ; Case 7g
CLIPS> (load* "attchtst4.clp")
TRUE
CLIPS> 
(defrule fail-pass-pass-both "Case 7g"
   (a (sa ?x))
   (exists (and (not (and (b (sb ?x))
                          (c (sc ?x))))
                (test (= 1 1))))
   =>)
CLIPS> 
(defrule fail-fail-fail-fail "Case 7g"
   (e (se ?x))
   (exists (and (not (and (f (sf ?x))
                          (g (sg ?x))))
                (test (!= 2 2))))
   =>)
CLIPS> (agenda)
CLIPS> (assert (a (sa 1)) (e (se 1)) (a (sa 2)) (e (se 2)))
<Fact-4>
CLIPS> (agenda)
0      fail-pass-pass-both: f-3,*
0      fail-pass-pass-both: f-1,*
For a total of 2 activations.
CLIPS> (assert (b (sb 1)) (f (sf 1)))
<Fact-6>
CLIPS> (agenda)
0      fail-pass-pass-both: f-3,*
0      fail-pass-pass-both: f-1,*
For a total of 2 activations.
CLIPS> (assert (c (sc 1)) (g (sg 1)))
<Fact-8>
CLIPS> (agenda)
0      fail-pass-pass-both: f-3,*
For a total of 1 activation.
CLIPS> (clear) ; Case 7h
CLIPS> (load* "attchtst4.clp")
TRUE
CLIPS> 
(defrule fail-fail-fail-both "Case 7h"
   (a (sa ?x))
   (exists (and (exists (and (b (sb ?x))
                             (c (sc ?x))))
                (test (= 1 1))))
   =>)
CLIPS> 
(defrule fail-fail-fail-fail "Case 7h"
   (e (se ?x))
   (exists (and (exists (and (f (sf ?x))
                             (g (sg ?x))))
                (test (!= 2 2))))
   =>)
CLIPS> (agenda)
CLIPS> (assert (a (sa 1)) (e (se 1)) (a (sa 2)) (e (se 2)))
<Fact-4>
CLIPS> (agenda)
CLIPS> (assert (b (sb 1)) (f (sf 1)))
<Fact-6>
CLIPS> (agenda)
CLIPS> (assert (c (sc 1)) (g (sg 1)))
<Fact-8>
CLIPS> (agenda)
0      fail-fail-fail-both: f-1,*
For a total of 1 activation.
CLIPS> (clear) ; Case 7i
CLIPS> (load* "attchtst4.clp")
TRUE
CLIPS> 
(defrule fail-fail-fail-both "Case 7i"
   (x)
   (a (sa ?x))
   (not (and (not (and (b (sb ?x))
                       (c (sc ?x))))
             (test (= 1 1))))
   =>)
CLIPS> 
(defrule fail-pass-pass-pass "Case 7i"
   (x)
   (e (se ?x))
   (not (and (not (and (f (sf ?x))
                       (g (sg ?x))))
             (test (!= 2 2))))
   =>)
CLIPS> (assert (x))
<Fact-1>
CLIPS> (agenda)
CLIPS> (assert (a (sa 1)) (e (se 1)) (a (sa 2)) (e (se 2)))
<Fact-5>
CLIPS> (agenda)
0      fail-pass-pass-pass: f-1,f-5,*
0      fail-pass-pass-pass: f-1,f-3,*
For a total of 2 activations.
CLIPS> (assert (b (sb 1)) (f (sf 1)))
<Fact-7>
CLIPS> (agenda)
0      fail-pass-pass-pass: f-1,f-5,*
0      fail-pass-pass-pass: f-1,f-3,*
For a total of 2 activations.
CLIPS> (assert (c (sc 1)) (g (sg 1)))
<Fact-9>
CLIPS> (agenda)
0      fail-fail-fail-both: f-1,f-2,*
0      fail-pass-pass-pass: f-1,f-5,*
0      fail-pass-pass-pass: f-1,f-3,*
For a total of 3 activations.
CLIPS> (clear) ; Case 7j
CLIPS> (load* "attchtst4.clp")
TRUE
CLIPS> 
(defrule fail-pass-pass-both "Case 7j"
   (x)
   (a (sa ?x))
   (not (and (exists (and (b (sb ?x))
                          (c (sc ?x))))
             (test (= 1 1))))
   =>)
CLIPS> 
(defrule fail-pass-pass-pass "Case 7j"
   (x)
   (e (se ?x))
   (not (and (exists (and (f (sf ?x))
                          (g (sg ?x))))
             (test (!= 2 2))))
   =>)
CLIPS> (assert (x))
<Fact-1>
CLIPS> (agenda)
CLIPS> (assert (a (sa 1)) (e (se 1)) (a (sa 2)) (e (se 2)))
<Fact-5>
CLIPS> (agenda)
0      fail-pass-pass-pass: f-1,f-5,*
0      fail-pass-pass-both: f-1,f-4,*
0      fail-pass-pass-pass: f-1,f-3,*
0      fail-pass-pass-both: f-1,f-2,*
For a total of 4 activations.
CLIPS> (assert (b (sb 1)) (f (sf 1)))
<Fact-7>
CLIPS> (agenda)
0      fail-pass-pass-pass: f-1,f-5,*
0      fail-pass-pass-both: f-1,f-4,*
0      fail-pass-pass-pass: f-1,f-3,*
0      fail-pass-pass-both: f-1,f-2,*
For a total of 4 activations.
CLIPS> (assert (c (sc 1)) (g (sg 1)))
<Fact-9>
CLIPS> (agenda)
0      fail-pass-pass-pass: f-1,f-5,*
0      fail-pass-pass-both: f-1,f-4,*
0      fail-pass-pass-pass: f-1,f-3,*
For a total of 3 activations.
CLIPS> (clear) ; Case 7k
CLIPS> (load* "attchtst4.clp")
TRUE
CLIPS> 
(defrule fail-pass-pass-both "Case 7k"
   (x)
   (a (sa ?x))
   (exists (and (not (and (b (sb ?x))
                          (c (sc ?x))))
                (test (= 1 1))))
   =>)
CLIPS> 
(defrule fail-fail-fail-fail "Case 7k"
   (x)
   (e (se ?x))
   (exists (and (not (and (f (sf ?x))
                          (g (sg ?x))))
                (test (!= 2 2))))
   =>)
CLIPS> (assert (x))
<Fact-1>
CLIPS> (agenda)
CLIPS> (assert (a (sa 1)) (e (se 1)) (a (sa 2)) (e (se 2)))
<Fact-5>
CLIPS> (agenda)
0      fail-pass-pass-both: f-1,f-4,*
0      fail-pass-pass-both: f-1,f-2,*
For a total of 2 activations.
CLIPS> (assert (b (sb 1)) (f (sf 1)))
<Fact-7>
CLIPS> (agenda)
0      fail-pass-pass-both: f-1,f-4,*
0      fail-pass-pass-both: f-1,f-2,*
For a total of 2 activations.
CLIPS> (assert (c (sc 1)) (g (sg 1)))
<Fact-9>
CLIPS> (agenda)
0      fail-pass-pass-both: f-1,f-4,*
For a total of 1 activation.
CLIPS> (clear) ; Case 7l
CLIPS> (load* "attchtst4.clp")
TRUE
CLIPS> 
(defrule fail-fail-fail-both "Case 7l"
   (x)
   (a (sa ?x))
   (exists (and (exists (and (b (sb ?x))
                             (c (sc ?x))))
                (test (= 1 1))))
   =>)
CLIPS> 
(defrule fail-fail-fail-fail "Case 7l"
   (x)
   (e (se ?x))
   (exists (and (exists (and (f (sf ?x))
                             (g (sg ?x))))
                (test (!= 2 2))))
   =>)
CLIPS> (assert (x))
<Fact-1>
CLIPS> (agenda)
CLIPS> (assert (a (sa 1)) (e (se 1)) (a (sa 2)) (e (se 2)))
<Fact-5>
CLIPS> (agenda)
CLIPS> (assert (b (sb 1)) (f (sf 1)))
<Fact-7>
CLIPS> (agenda)
CLIPS> (assert (c (sc 1)) (g (sg 1)))
<Fact-9>
CLIPS> (agenda)
0      fail-fail-fail-both: f-1,f-2,*
For a total of 1 activation.
CLIPS> (clear)
CLIPS> (dribble-off)
