TRUE
CLIPS> (batch "predcfnx.bat")
TRUE
CLIPS> (numberp)                          ; 10.2.1
[ARGACCES4] Function numberp expected exactly 1 argument(s)
CLIPS> (numberp 3 a)                      ; 10.2.1
[ARGACCES4] Function numberp expected exactly 1 argument(s)
CLIPS> (numberp 8)                        ; 10.2.1
TRUE
CLIPS> (numberp 8.1)                      ; 10.2.1
TRUE
CLIPS> (numberp "hit")                    ; 10.2.1
FALSE
CLIPS> (floatp)                           ; 10.2.2
[ARGACCES4] Function floatp expected exactly 1 argument(s)
CLIPS> (floatp 3 a)                       ; 10.2.2
[ARGACCES4] Function floatp expected exactly 1 argument(s)
CLIPS> (floatp 8)                         ; 10.2.2
FALSE
CLIPS> (floatp 8.1)                       ; 10.2.2
TRUE
CLIPS> (floatp "hit")                     ; 10.2.2
FALSE
CLIPS> (integerp)                         ; 10.2.3
[ARGACCES4] Function integerp expected exactly 1 argument(s)
CLIPS> (integerp 3 a)                     ; 10.2.3
[ARGACCES4] Function integerp expected exactly 1 argument(s)
CLIPS> (integerp 8)                       ; 10.2.3
TRUE
CLIPS> (integerp 8.1)                     ; 10.2.3
FALSE
CLIPS> (integerp "hit")                   ; 10.2.3
FALSE
CLIPS> (lexemep)                          ; 10.2.4
[ARGACCES4] Function lexemep expected exactly 1 argument(s)
CLIPS> (lexemep a 3)                      ; 10.2.4
[ARGACCES4] Function lexemep expected exactly 1 argument(s)
CLIPS> (lexemep b)                        ; 10.2.4
TRUE
CLIPS> (lexemep "a w")                    ; 10.2.4
TRUE
CLIPS> (lexemep [this])                   ; 10.2.4
FALSE
CLIPS> (stringp)                          ; 10.2.5
[ARGACCES4] Function stringp expected exactly 1 argument(s)
CLIPS> (stringp a 3)                      ; 10.2.5
[ARGACCES4] Function stringp expected exactly 1 argument(s)
CLIPS> (stringp b)                        ; 10.2.5
FALSE
CLIPS> (stringp "a w")                    ; 10.2.5
TRUE
CLIPS> (stringp [this])                   ; 10.2.5
FALSE
CLIPS> (symbolp)                          ; 10.2.6
[ARGACCES4] Function symbolp expected exactly 1 argument(s)
CLIPS> (symbolp a 3)                      ; 10.2.6
[ARGACCES4] Function symbolp expected exactly 1 argument(s)
CLIPS> (symbolp b)                        ; 10.2.6
TRUE
CLIPS> (symbolp "a w")                    ; 10.2.6
FALSE
CLIPS> (symbolp [this])                   ; 10.2.6
FALSE
CLIPS> (evenp)                            ; 10.2.7
[ARGACCES4] Function evenp expected exactly 1 argument(s)
CLIPS> (evenp 3 a)                        ; 10.2.7
[ARGACCES4] Function evenp expected exactly 1 argument(s)
CLIPS> (evenp 8)                          ; 10.2.7
TRUE
CLIPS> (evenp 9)                          ; 10.2.7
FALSE
CLIPS> (evenp "hit")                      ; 10.2.7
[ARGACCES5] Function evenp expected argument #1 to be of type integer
CLIPS> (oddp)                             ; 10.2.8
[ARGACCES4] Function oddp expected exactly 1 argument(s)
CLIPS> (oddp 3 a)                         ; 10.2.8
[ARGACCES4] Function oddp expected exactly 1 argument(s)
CLIPS> (oddp 8)                           ; 10.2.8
FALSE
CLIPS> (oddp 9)                           ; 10.2.8
TRUE
CLIPS> (oddp "hit")                       ; 10.2.8
[ARGACCES5] Function oddp expected argument #1 to be of type integer
CLIPS> (multifieldp)                      ; 10.2.9
[ARGACCES4] Function multifieldp expected exactly 1 argument(s)
CLIPS> (multifieldp (create$ x) a)        ; 10.2.9
[ARGACCES4] Function multifieldp expected exactly 1 argument(s)
CLIPS> (multifieldp (create$))            ; 10.2.9
TRUE
CLIPS> (multifieldp (create$ a 3 4.1))    ; 10.2.9
TRUE
CLIPS> (multifieldp "hit")                ; 10.2.9
FALSE
CLIPS> (pointerp)                         ; 10.2.10
[ARGACCES4] Function pointerp expected exactly 1 argument(s)
CLIPS> (pointerp 3 a)                     ; 10.2.10
[ARGACCES4] Function pointerp expected exactly 1 argument(s)
CLIPS> (pointerp 3)                       ; 10.2.10
FALSE
CLIPS> (pointerp x)                       ; 10.2.10
FALSE
CLIPS> (eq)                               ; 10.2.11
[ARGACCES4] Function eq expected at least 2 argument(s)
CLIPS> (eq a)                             ; 10.2.11
[ARGACCES4] Function eq expected at least 2 argument(s)
CLIPS> (eq a a b)                         ; 10.2.11
FALSE
CLIPS> (eq a a a)                         ; 10.2.11
TRUE
CLIPS> (eq a a)                           ; 10.2.11
TRUE
CLIPS> (eq a b)                           ; 10.2.11
FALSE
CLIPS> (eq a "a")                         ; 10.2.11
FALSE
CLIPS> (eq 3 3)                           ; 10.2.11
TRUE
CLIPS> (eq 3 3.0)                         ; 10.2.11
FALSE
CLIPS> (eq 3 3.1)                         ; 10.2.11
FALSE
CLIPS> (eq a (create$ a))                 ; 10.2.11
FALSE
CLIPS> (eq 3 (create$ a))                 ; 10.2.11
FALSE
CLIPS> (eq a (create$ b))                 ; 10.2.11
FALSE
CLIPS> (eq (create$ a b) (create$ c d))   ; 10.2.11
FALSE
CLIPS> (eq (create$) (create$))           ; 10.2.11
TRUE
CLIPS> (eq (create$ a) (create$ a))       ; 10.2.11
TRUE
CLIPS> (eq (create$ a) (create$ b))       ; 10.2.11
FALSE
CLIPS> (eq (create$ a b) (create$ a b))   ; 10.2.11
TRUE
CLIPS> (eq (create$ a b) (create$ a))     ; 10.2.11
FALSE
CLIPS> (neq)                              ; 10.2.12
[ARGACCES4] Function neq expected at least 2 argument(s)
CLIPS> (neq a)                            ; 10.2.12
[ARGACCES4] Function neq expected at least 2 argument(s)
CLIPS> (neq a a b)                        ; 10.2.12
FALSE
CLIPS> (neq a b c)                        ; 10.2.12
TRUE
CLIPS> (neq a a a)                        ; 10.2.12
FALSE
CLIPS> (neq a a)                          ; 10.2.12
FALSE
CLIPS> (neq a b)                          ; 10.2.12
TRUE
CLIPS> (neq a "a")                        ; 10.2.12
TRUE
CLIPS> (neq 3 3)                          ; 10.2.12
FALSE
CLIPS> (neq 3 3.0)                        ; 10.2.12
TRUE
CLIPS> (neq 3 3.1)                        ; 10.2.12
TRUE
CLIPS> (neq a (create$ a))                ; 10.2.12
TRUE
CLIPS> (neq 3 (create$ a))                ; 10.2.12
TRUE
CLIPS> (neq a (create$ b))                ; 10.2.12
TRUE
CLIPS> (neq (create$ a b) (create$ c d))  ; 10.2.12
TRUE
CLIPS> (neq (create$) (create$))          ; 10.2.12
FALSE
CLIPS> (neq (create$ a) (create$ a))      ; 10.2.12
FALSE
CLIPS> (neq (create$ b) (create$ a))      ; 10.2.12
TRUE
CLIPS> (neq (create$ a b) (create$ a b))  ; 10.2.12
FALSE
CLIPS> (neq (create$ a b) (create$ a))    ; 10.2.12
TRUE
CLIPS> (=)                                ; 10.2.13
[ARGACCES4] Function = expected at least 2 argument(s)
CLIPS> (= 3)                              ; 10.2.13
[ARGACCES4] Function = expected at least 2 argument(s)
CLIPS> (= 3 3)                            ; 10.2.13
TRUE
CLIPS> (= 13.7 13.7)                      ; 10.2.13
TRUE
CLIPS> (= 3 3.0)                          ; 10.2.13
TRUE
CLIPS> (= 3 3.0 3)                        ; 10.2.13
TRUE
CLIPS> (= 3 3.0 4)                        ; 10.2.13
FALSE
CLIPS> (= 3.0 3 4)                        ; 10.2.13
FALSE
CLIPS> (= 3 a)                            ; 10.2.13
[ARGACCES5] Function = expected argument #2 to be of type integer or float
CLIPS> (= 3 ?x)                           ; 10.2.13
[EVALUATN1] Variable x is unbound
[ARGACCES5] Function = expected argument #2 to be of type integer or float
FALSE
CLIPS> (<>)                               ; 10.2.14
[ARGACCES4] Function <> expected at least 2 argument(s)
CLIPS> (<> 3)                             ; 10.2.14
[ARGACCES4] Function <> expected at least 2 argument(s)
CLIPS> (<> 3 3)                           ; 10.2.14
FALSE
CLIPS> (<> 13.7 13.7)                     ; 10.2.14
FALSE
CLIPS> (<> 3 3.0)                         ; 10.2.14
FALSE
CLIPS> (<> 3 3.0 3)                       ; 10.2.14
FALSE
CLIPS> (<> 3 3.0 4)                       ; 10.2.14
FALSE
CLIPS> (<> 3 4.0 4)                       ; 10.2.14
TRUE
CLIPS> (<> 3.0 3 4)                       ; 10.2.14
FALSE
CLIPS> (<> 3 a)                           ; 10.2.14
[ARGACCES5] Function <> expected argument #2 to be of type integer or float
CLIPS> (<> 3 ?x)                          ; 10.2.14
[EVALUATN1] Variable x is unbound
[ARGACCES5] Function <> expected argument #2 to be of type integer or float
FALSE
CLIPS> (>)                                ; 10.2.15
[ARGACCES4] Function > expected at least 2 argument(s)
CLIPS> (> 3)                              ; 10.2.15
[ARGACCES4] Function > expected at least 2 argument(s)
CLIPS> (> 3 3)                            ; 10.2.15
FALSE
CLIPS> (> 3.3 3.3)                        ; 10.2.15
FALSE
CLIPS> (> 3 3.0)                          ; 10.2.15
FALSE
CLIPS> (> 3.0 3)                          ; 10.2.15
FALSE
CLIPS> (> 4 3)                            ; 10.2.15
TRUE
CLIPS> (> 3 4)                            ; 10.2.15
FALSE
CLIPS> (> 4.1 3.3)                        ; 10.2.15
TRUE
CLIPS> (> 3.3 4.1)                        ; 10.2.15
FALSE
CLIPS> (> 3.1 3)                          ; 10.2.15
TRUE
CLIPS> (> 4 3.1)                          ; 10.2.15
TRUE
CLIPS> (> 3.4 4)                          ; 10.2.15
FALSE
CLIPS> (> 3 4.1)                          ; 10.2.15
FALSE
CLIPS> (> 3 4 5)                          ; 10.2.15
FALSE
CLIPS> (> 3.0 5.3 4)                      ; 10.2.15
FALSE
CLIPS> (> 4 3.0 5.3)                      ; 10.2.15
FALSE
CLIPS> (> 4 3.2 2)                        ; 10.2.15
TRUE
CLIPS> (> 4 4 3 3)                        ; 10.2.15
FALSE
CLIPS> (> 4 4 5 5)                        ; 10.2.15
FALSE
CLIPS> (>=)                               ; 10.2.16
[ARGACCES4] Function >= expected at least 2 argument(s)
CLIPS> (>= 3)                             ; 10.2.16
[ARGACCES4] Function >= expected at least 2 argument(s)
CLIPS> (>= 3 3)                           ; 10.2.16
TRUE
CLIPS> (>= 3.3 3.3)                       ; 10.2.16
TRUE
CLIPS> (>= 3 3.0)                         ; 10.2.16
TRUE
CLIPS> (>= 3.0 3)                         ; 10.2.16
TRUE
CLIPS> (>= 4 3)                           ; 10.2.16
TRUE
CLIPS> (>= 3 4)                           ; 10.2.16
FALSE
CLIPS> (>= 4.1 3.3)                       ; 10.2.16
TRUE
CLIPS> (>= 3.3 4.1)                       ; 10.2.16
FALSE
CLIPS> (>= 3.1 3)                         ; 10.2.16
TRUE
CLIPS> (>= 4 3.1)                         ; 10.2.16
TRUE
CLIPS> (>= 3.4 4)                         ; 10.2.16
FALSE
CLIPS> (>= 3 4.1)                         ; 10.2.16
FALSE
CLIPS> (>= 3 4 5)                         ; 10.2.16
FALSE
CLIPS> (>= 3.0 5.3 4)                     ; 10.2.16
FALSE
CLIPS> (>= 4 3.0 5.3)                     ; 10.2.16
FALSE
CLIPS> (>= 4 3.2 2)                       ; 10.2.16
TRUE
CLIPS> (>= 4 4 3 3)                       ; 10.2.16
TRUE
CLIPS> (>= 4 4 5 5)                       ; 10.2.16
FALSE
CLIPS> (<)                                ; 10.2.17
[ARGACCES4] Function < expected at least 2 argument(s)
CLIPS> (< 3)                              ; 10.2.17
[ARGACCES4] Function < expected at least 2 argument(s)
CLIPS> (< 3 3)                            ; 10.2.17
FALSE
CLIPS> (< 3.3 3.3)                        ; 10.2.17
FALSE
CLIPS> (< 3 3.0)                          ; 10.2.17
FALSE
CLIPS> (< 3.0 3)                          ; 10.2.17
FALSE
CLIPS> (< 4 3)                            ; 10.2.17
FALSE
CLIPS> (< 3 4)                            ; 10.2.17
TRUE
CLIPS> (< 4.1 3.3)                        ; 10.2.17
FALSE
CLIPS> (< 3.3 4.1)                        ; 10.2.17
TRUE
CLIPS> (< 3.1 3)                          ; 10.2.17
FALSE
CLIPS> (< 4 3.1)                          ; 10.2.17
FALSE
CLIPS> (< 3.4 4)                          ; 10.2.17
TRUE
CLIPS> (< 3 4.1)                          ; 10.2.17
TRUE
CLIPS> (< 3 4 5)                          ; 10.2.17
TRUE
CLIPS> (< 3.0 5.3 4)                      ; 10.2.17
FALSE
CLIPS> (< 4 3.0 5.3)                      ; 10.2.17
FALSE
CLIPS> (< 4 3.2 2)                        ; 10.2.17
FALSE
CLIPS> (< 4 4 3 3)                        ; 10.2.17
FALSE
CLIPS> (< 4 4 5 5)                        ; 10.2.17
FALSE
CLIPS> (<=)                               ; 10.2.18
[ARGACCES4] Function <= expected at least 2 argument(s)
CLIPS> (<= 3)                             ; 10.2.18
[ARGACCES4] Function <= expected at least 2 argument(s)
CLIPS> (<= 3 3)                           ; 10.2.18
TRUE
CLIPS> (<= 3.3 3.3)                       ; 10.2.18
TRUE
CLIPS> (<= 3 3.0)                         ; 10.2.18
TRUE
CLIPS> (<= 3.0 3)                         ; 10.2.18
TRUE
CLIPS> (<= 4 3)                           ; 10.2.18
FALSE
CLIPS> (<= 3 4)                           ; 10.2.18
TRUE
CLIPS> (<= 4.1 3.3)                       ; 10.2.18
FALSE
CLIPS> (<= 3.3 4.1)                       ; 10.2.18
TRUE
CLIPS> (<= 3.1 3)                         ; 10.2.18
FALSE
CLIPS> (<= 4 3.1)                         ; 10.2.18
FALSE
CLIPS> (<= 3.4 4)                         ; 10.2.18
TRUE
CLIPS> (<= 3 4.1)                         ; 10.2.18
TRUE
CLIPS> (<= 3 4 5)                         ; 10.2.18
TRUE
CLIPS> (<= 3.0 5.3 4)                     ; 10.2.18
FALSE
CLIPS> (<= 4 3.0 5.3)                     ; 10.2.18
FALSE
CLIPS> (<= 4 3.2 2)                       ; 10.2.18
FALSE
CLIPS> (<= 4 4 3 3)                       ; 10.2.18
FALSE
CLIPS> (<= 4 4 5 5)                       ; 10.2.18
TRUE
CLIPS> (and)                              ; 10.2.19
[ARGACCES4] Function and expected at least 2 argument(s)
CLIPS> (and TRUE)                         ; 10.2.19        
[ARGACCES4] Function and expected at least 2 argument(s)
CLIPS> (and TRUE 1)                       ; 10.2.19
TRUE
CLIPS> (and TRUE FALSE)                   ; 10.2.19
FALSE
CLIPS> (and FALSE 0)                      ; 10.2.19
FALSE
CLIPS> (and 0 1 a)                        ; 10.2.19
TRUE
CLIPS> (and "s" 3.4 FALSE)                ; 10.2.19
FALSE
CLIPS> (and 0 1 TRUE a "a" [a] 3.5 (create$) (create$ a))
TRUE
CLIPS> (or)                               ; 10.2.20
[ARGACCES4] Function or expected at least 2 argument(s)
CLIPS> (or FALSE)                         ; 10.2.20
[ARGACCES4] Function or expected at least 2 argument(s)
CLIPS> (or FALSE FALSE)                   ; 10.2.20
FALSE
CLIPS> (or FALSE 1)                       ; 10.2.20
TRUE
CLIPS> (or 0 FALSE)                       ; 10.2.20
TRUE
CLIPS> (or FALSE a)                       ; 10.2.20
TRUE
CLIPS> (or "s" FALSE)                     ; 10.2.20
TRUE
CLIPS> (or FALSE 3.5)                     ; 10.2.20
TRUE
CLIPS> (or TRUE FALSE)                    ; 10.2.20
TRUE
CLIPS> (or FALSE TRUE)                    ; 10.2.20
TRUE
CLIPS> (or (create$) FALSE)               ; 10.2.20
TRUE
CLIPS> (or FALSE (create$ a b))           ; 10.2.20
TRUE
CLIPS> (or FALSE FALSE TRUE)              ; 10.2.20
TRUE
CLIPS> (not)                              ; 10.2.21
[ARGACCES4] Function not expected exactly 1 argument(s)
CLIPS> (not FALSE)                        ; 10.2.21
TRUE
CLIPS> (not TRUE)                         ; 10.2.21
FALSE
CLIPS> (not 0)                            ; 10.2.21
FALSE
CLIPS> (not 1)                            ; 10.2.21
FALSE
CLIPS> (not 3.5)                          ; 10.2.21
FALSE
CLIPS> (not a)                            ; 10.2.21
FALSE
CLIPS> (not "a")                          ; 10.2.21
FALSE
CLIPS> (not [a])                          ; 10.2.21
FALSE
CLIPS> (not (create$))                    ; 10.2.21
FALSE
CLIPS> (not (create$ x y))                ; 10.2.21
FALSE
CLIPS> (not x y)                          ; 10.2.21
[ARGACCES4] Function not expected exactly 1 argument(s)
CLIPS> (dribble-off)
